feat: loadgen updated
